All the segments on this grid line will be added.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public void AddAllSegments()
  Visual Basic
Public Sub AddAllSegments
  Visual C++
public:
void AddAllSegments()
 See Also
  CurtainGridLine Class
  Autodesk.Revit.DB Namespace